{"config": [{"config": {"nb_col": 3, "input_dtype": "float32", "bias": true, "b_regularizer": null, "name": "convolution2d_9", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "th", "nb_filter": 32, "b_constraint": null, "nb_row": 3, "batch_input_shape": [null, 3, 40, 40], "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_12", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 3, "bias": true, "name": "convolution2d_10", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "th", "nb_filter": 32, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_5", "trainable": true, "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_7", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"nb_col": 3, "bias": true, "name": "convolution2d_11", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "same", "dim_ordering": "th", "nb_filter": 64, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"nb_col": 3, "bias": true, "name": "convolution2d_12", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "dim_ordering": "th", "nb_filter": 64, "b_constraint": null, "nb_row": 3, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "trainable": true, "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_6", "trainable": true, "border_mode": "valid", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_8", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "bias": true, "b_regularizer": null, "name": "dense_4", "output_dim": 512, "activation": "linear", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_16", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_9", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "bias": true, "b_regularizer": null, "name": "dense_5", "output_dim": 27, "activation": "linear", "b_constraint": null, "W_regularizer": null, "activity_regularizer": null, "trainable": true, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"name": "activation_17", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}